app/Controllers/Home.php

SELECT *
FROM `tb_foto`
---
    public function index()
    {
        $db = db_connect();
        $data['file'] = $db->table('tb_foto')->get()->getResult();

INSERT INTO `tb_foto` (`nobp`, `nama`, `jurusan`, `semester`, `file`) VALUES ('1800001', 'Pirdaus', 'MI', 'Ganjil', '1665587853_42d56269c5a79fb0096b.pdf')
---
    public function save ()
    {
        $db = db_connect();
        $file = $this->request->getFile('file');
        $filename = $file->getRandomName();

        if($file == ""){
            $data = [
                'nobp' => $this->request->getPost('nobp'),
                'nama' => $this->request->getPost('nama'),
                'jurusan' => $this->request->getPost('jurusan'),
                'semester' => $this->request->getPost('semester'),
            ];
        }else{
            $data = [
                'nobp' => $this->request->getPost('nobp'),
                'nama' => $this->request->getPost('nama'),
                'jurusan' => $this->request->getPost('jurusan'),
                'semester' => $this->request->getPost('semester'),
                'file' => $filename
            ];
            $file->move('file/', $filename);
        }

        $simpan = $db->table('tb_foto')->insert($data);